#include <iostream>
#include <string>
#include <vector>
#include <Windows.h> 
#include <fstream>
//#include <conio.h> 

using namespace std;

class  алендарнеѕлануванн€
{
private:
	int р≥кѕочаткуЌавчальнного–оку;
	int р≥к«ак≥нченн€Ќавчальнного–оку;

	int деньѕершого”року;

	int датаѕершого”року;
	int дата2ого”року;
	int дата3ого”року;
	int дата4ого”року;
	int дата5ого”року;
	int дата6ого”року;
	int дата05”року;

	int датаќстанньогоƒзв≥нка;

	int початокќс≥нн≥х ан≥кул;
	int к≥нецьќс≥нн≥х ан≥кул;
	int початок«имових ан≥кул;
	int к≥нець«имових ан≥кул;
	int початок¬есн€них ан≥кул;
	int к≥нець¬есн€них ан≥кул;

	bool високосний–≥кѕочаткуЌавчальнного–оку;
	bool високосний–≥к«ак≥нченн€Ќавчальнного–оку;

	int к≥льк≥сть”рок≥в«а–≥к;
	int к≥льк≥сть”рок≥в«а1семестр;
	int к≥льк≥сть”рок≥в«а2семестр;

public:
	 алендарнеѕлануванн€()
	{
		р≥кѕочаткуЌавчальнного–оку = 0;
		р≥к«ак≥нченн€Ќавчальнного–оку = 0;

		деньѕершого”року = 1;

		датаѕершого”року = 0;
		дата2ого”року = 0;
		дата3ого”року = 0;
		дата4ого”року = 0;
		дата5ого”року = 0;
		дата6ого”року = 0;
		дата05”року = 0;

		датаќстанньогоƒзв≥нка = 0;

		початокќс≥нн≥х ан≥кул = 0;
		к≥нецьќс≥нн≥х ан≥кул = 0;
		початок«имових ан≥кул = 0;
		к≥нець«имових ан≥кул = 0;
		початок¬есн€них ан≥кул = 0;
		к≥нець¬есн€них ан≥кул = 0;

		високосний–≥кѕочаткуЌавчальнного–оку = 0;
		високосний–≥к«ак≥нченн€Ќавчальнного–оку = 0;

		к≥льк≥сть”рок≥в«а–≥к = 0;
		к≥льк≥сть”рок≥в«а1семестр = 0;
		к≥льк≥сть”рок≥в«а2семестр = 0;
	}

	void gotoxy(int x, int y)
	{
		COORD p = { x, y };
		SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), p);
	}

	void get ≥льк≥сть”рок≥в()
	{
		string save;

		for (;save != "y";)
		{
			gotoxy(0, 0);
			cout << " iлькiсть годин за навчальний рiк:\t" << к≥льк≥сть”рок≥в«а–≥к;

			gotoxy(0, 1);
			cout << " iлькiсть годин за 1 семестр:\t\t" << к≥льк≥сть”рок≥в«а1семестр;

			gotoxy(0, 2);
			cout << " iлькiсть годин за 2 семестр:\t\t" << к≥льк≥сть”рок≥в«а2семестр;

			gotoxy(0, к≥льк≥сть”рок≥в«а–≥к + 8);

			gotoxy(50, 0);
			cout << "ƒл€ того щоб зберегти данi в документ введiть:   y";
			gotoxy(50, 1);
			cin >> save;
		}
	}
	
	void set–≥кѕочаткуЌавчальнного–оку()
	{
		gotoxy(0, 22);

		int clearRow = 0;

		for (;;)
		{
			cout << "¬ведiть рiк початку навчальнного року:" << endl;
			
			string рiкѕочаткуЌ–;
			bool digit;

			cin >> рiкѕочаткуЌ–;
			
			for (auto i : рiкѕочаткуЌ–)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				р≥кѕочаткуЌавчальнного–оку = stoi(рiкѕочаткуЌ–);

				if (р≥кѕочаткуЌавчальнного–оку > 2021 && р≥кѕочаткуЌавчальнного–оку < 3000)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 2);
		cout << р≥кѕочаткуЌавчальнного–оку;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}

	void set–≥к«ак≥нченн€Ќавчальнного–оку()
	{
		р≥к«ак≥нченн€Ќавчальнного–оку = р≥кѕочаткуЌавчальнного–оку + 1;
	}

	void setƒатаѕершого”року()
	{
		gotoxy(0, 22);
		int clearRow = 0;

		for (;;)
		{
			cout << "¬ведiть дату першого уроку у форматi ƒƒћћ (приклад 0109, без символiв роздiленн€):" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				датаѕершого”року = stoi(les);

				if (датаѕершого”року > 100 && датаѕершого”року < 3113)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 3);
		cout << датаѕершого”року;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setƒата2ого”року()
	{
		gotoxy(0, 22);
		int clearRow = 0;

		for (;;)
		{
			cout << "¬ведiть дату 2-го уроку у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				дата2ого”року = stoi(les);

				if (дата2ого”року > 100 && дата2ого”року <= 3112)
				{
					cout << endl;
					break;
				}
				else if (дата2ого”року == 0)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 4);
		cout << дата2ого”року;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setƒата3ого”року()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату 3-го уроку у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				дата3ого”року = stoi(les);

				if (дата3ого”року > 100 && дата3ого”року < 3113)
				{
					cout << endl;
					break;
				}
				else if (дата3ого”року == 0)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 5);
		cout << дата3ого”року;

		for (int i = 23; i <= (28 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setƒата4ого”року()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату 4-го уроку у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				дата4ого”року = stoi(les);

				if (дата4ого”року > 100 && дата4ого”року < 3113)
				{
					cout << endl;
					break;
				}
				else if (дата4ого”року == 0)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 6);
		cout << дата4ого”року;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setƒата5ого”року()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату 5-го уроку у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				дата5ого”року = stoi(les);

				if (дата5ого”року > 100 && дата5ого”року < 3113)
				{
					cout << endl;
					break;
				}
				else if (дата5ого”року == 0)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 7);
		cout << дата5ого”року;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setƒата6ого”року()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату 6-го уроку у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				дата6ого”року = stoi(les);

				if (дата6ого”року > 100 && дата6ого”року < 3113)
				{
					cout << endl;
					break;
				}
				else if (дата6ого”року == 0)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 8);
		cout << дата6ого”року;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setƒатаѕоловини”року()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату 0.5-го уроку у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				дата05”року = stoi(les);

				if (дата05”року > 100 && дата05”року < 3113)
				{
					cout << endl;
					break;
				}
				else if (дата05”року == 0)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 9);
		cout << дата05”року;

		for (int i = 23; i <= (28 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}

	void setƒатаќстанньогоƒзв≥нка()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату останнього дзвiнка у форматi ƒƒћћ:" << endl;

			string ostanDzvinok;
			bool digit;

			cin >> ostanDzvinok;

			for (auto i : ostanDzvinok)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				датаќстанньогоƒзв≥нка = stoi(ostanDzvinok);

				if (датаќстанньогоƒзв≥нка > 100 && датаќстанньогоƒзв≥нка < 3113)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 10);
		cout << датаќстанньогоƒзв≥нка;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}

	void setѕочатокќс≥нн≥х ан≥кул()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату початку осiннiх канiкул у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				початокќс≥нн≥х ан≥кул = stoi(les);

				if (початокќс≥нн≥х ан≥кул > 100 && початокќс≥нн≥х ан≥кул <= 3112)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 11);
		cout << початокќс≥нн≥х ан≥кул;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void set ≥нецьќс≥нн≥х ан≥кул()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату першого робочого дн€ пiсл€ осiннiх канiкул у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				к≥нецьќс≥нн≥х ан≥кул = stoi(les);

				if (к≥нецьќс≥нн≥х ан≥кул > 100 && к≥нецьќс≥нн≥х ан≥кул <= 3112)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 12);
		cout << к≥нецьќс≥нн≥х ан≥кул;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setѕочаток«имових ан≥кул()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату початку зимових канiкул у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				початок«имових ан≥кул = stoi(les);

				if (початок«имових ан≥кул > 100 && початок«имових ан≥кул <= 3112)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 13);
		cout << початок«имових ан≥кул;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void set ≥нець«имових ан≥кул()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату першого робочого дн€ пiсл€ зимових канiкул у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				к≥нець«имових ан≥кул = stoi(les);

				if (к≥нець«имових ан≥кул > 100 && к≥нець«имових ан≥кул <= 3112)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 14);
		cout << к≥нець«имових ан≥кул;

		for (int i = 23; i <= (27 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void setѕочаток¬ен€них ан≥кул()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату початку весн€них канiкул у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				початок¬есн€них ан≥кул = stoi(les);

				if (початок¬есн€них ан≥кул > 100 && початок¬есн€них ан≥кул <= 3112)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 15);
		cout << початок¬есн€них ан≥кул;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}
	void set ≥нець¬есн€них ан≥кул()
	{
		gotoxy(0, 22);
		int clearRow = 0;
		
		for (;;)
		{
			cout << "¬ведiть дату першого робочого дн€ пiсл€ весн€них канiкул у форматi ƒƒћћ:" << endl;

			string les;
			bool digit;

			cin >> les;

			for (auto i : les)
			{
				if (isdigit(i))
				{
					digit = 1;
				}
				else
				{
					digit = 0;
					break;
				}
			}

			if (digit)
			{
				к≥нець¬есн€них ан≥кул = stoi(les);

				if (к≥нець¬есн€них ан≥кул > 100 && к≥нець¬есн€них ан≥кул <= 3112)
				{
					cout << endl;
					break;
				}
				else
				{
					cout << "Ќекоректний ввiд!" << endl;
					clearRow++;
				}
			}
			else
			{
				cout << "Ќекоректний ввiд!" << endl;
				clearRow++;
			}
		}

		gotoxy(40, 16);
		cout << к≥нець¬есн€них ан≥кул;

		for (int i = 23; i <= (23 + clearRow * 3); i++)
		{
			gotoxy(0, i);
			cout << "                                                                                 " << endl;
		}

		gotoxy(0, 0);
	}

	// перший м≥с€ць - вересень
	vector <int> ƒовжинаћ≥с€ц€{ 30, 31, 30, 31, 31, 28, 31, 30, 31, 30, 31, 31 };

	vector <int> ƒержавн≥—в€та{ 1410, 2512, 803, 1604, 905 };

	vector <int> вс≥ƒатиЌавчального–оку;

	vector <int> ƒати”рок≥в;

	void ¬веденн€ƒаних()
	{
		system("cls");

		cout << "Bведiть данi:" << endl << endl;

		cout << "1. –iк початку навчальнного року:\t" << р≥кѕочаткуЌавчальнного–оку << endl;

		cout << "2. ƒата 1-ого уроку:\t\t\t" << датаѕершого”року << endl;
		cout << "3. ƒата 2-ого уроку:\t\t\t" << дата2ого”року << endl;
		cout << "4. ƒата 3-ого уроку:\t\t\t" << дата3ого”року << endl;
		cout << "5. ƒата 4-ого уроку:\t\t\t" << дата4ого”року << endl;
		cout << "6. ƒата 5-ого уроку:\t\t\t" << дата5ого”року << endl;
		cout << "7. ƒата 6-ого уроку:\t\t\t" << дата6ого”року << endl;
		cout << "8. ƒата половинки уроку:\t\t" << дата2ого”року << endl;

		cout << "9. ƒата останього дзвiнка:\t\t" << датаќстанньогоƒзв≥нка << endl;

		cout << "10. ѕочаток осiннiх канiкул:\t\t" << початокќс≥нн≥х ан≥кул << endl;
		cout << "11.  iнець осiннiх канiкул:\t\t" << к≥нецьќс≥нн≥х ан≥кул << endl;
		cout << "12. ѕочаток зимових канiкул:\t\t" << початок«имових ан≥кул << endl;
		cout << "13.  iнець зимових канiкул:\t\t" << к≥нець«имових ан≥кул << endl;
		cout << "14. ѕочаток весн€них канiкул:\t\t" << початок¬есн€них ан≥кул << endl;
		cout << "15.  iнець весн€них канiкул:\t\t" << к≥нець¬есн€них ан≥кул << endl << endl;

		set–≥кѕочаткуЌавчальнного–оку();
		setƒатаѕершого”року();
		setƒата2ого”року();
		setƒата3ого”року();
		setƒата4ого”року();
		setƒата5ого”року();
		setƒата6ого”року();
		setƒатаѕоловини”року();

		setƒатаќстанньогоƒзв≥нка();

		setѕочатокќс≥нн≥х ан≥кул();
		set ≥нецьќс≥нн≥х ан≥кул();
		setѕочаток«имових ан≥кул();
		set ≥нець«имових ан≥кул();
		setѕочаток¬ен€них ан≥кул();
		set ≥нець¬есн€них ан≥кул();
	}

	void ѕерев≥рка¬веденихƒаних()
	{
		bool ѕравильн≥ƒан≥ = 0;
		for (; !ѕравильн≥ƒан≥;)
		{
			system("cls");

			cout << "ѕеревiрте введенi данi." << endl << endl;

			cout << "1. –iк початку навчальнного року:\t" << р≥кѕочаткуЌавчальнного–оку << endl;

			cout << "2. ƒата 1-ого уроку:\t\t\t" << датаѕершого”року << endl;
			cout << "3. ƒата 2-ого уроку:\t\t\t" << дата2ого”року << endl;
			cout << "4. ƒата 3-ого уроку:\t\t\t" << дата3ого”року << endl;
			cout << "5. ƒата 4-ого уроку:\t\t\t" << дата4ого”року << endl;
			cout << "6. ƒата 5-ого уроку:\t\t\t" << дата5ого”року << endl;
			cout << "7. ƒата 6-ого уроку:\t\t\t" << дата6ого”року << endl;
			cout << "8. ƒата половинки уроку:\t\t" << дата05”року << endl;

			cout << "9. ƒата останього дзвiнка:\t\t" << датаќстанньогоƒзв≥нка << endl;

			cout << "10. ѕочаток осiннiх канiкул:\t\t" << початокќс≥нн≥х ан≥кул << endl;
			cout << "11.  iнець осiннiх канiкул:\t\t" << к≥нецьќс≥нн≥х ан≥кул << endl;
			cout << "12. ѕочаток зимових канiкул:\t\t" << початок«имових ан≥кул << endl;
			cout << "13.  iнець зимових канiкул:\t\t" << к≥нець«имових ан≥кул << endl;
			cout << "14. ѕочаток весн€них канiкул:\t\t" << початок¬есн€них ан≥кул << endl;
			cout << "15.  iнець весн€них канiкул:\t\t" << к≥нець¬есн€них ан≥кул << endl << endl;

			cout << "якщо все правильно введiть:\t\ty" << endl;
			cout << "якщо десь допустили помилку введiть:\tn" << endl << endl;

			string ch;

			for (;;)
			{
				cin >> ch;

				if (ch == "y" || ch == "n")
				{
					break;
				}
			}

			gotoxy(0, 21);
			cout << "                                   ";

			if (ch == "y")
			{
				ѕравильн≥ƒан≥ = true;
			}
			else if (ch == "n")
			{
				ѕравильн≥ƒан≥ = false;
			}
			
			if (!ѕравильн≥ƒан≥)
			{
				int nomerRyada = 0;

				for (;;)
				{
					gotoxy(0, 21);
					cout << "Ќапишiть номер р€дка де допустили помилку:" << endl;

					string номер–€дка;
					bool digit;

					cin >> номер–€дка;

					gotoxy(0, 21);
					cout << "                                              :" << endl;



					for (auto i : номер–€дка)
					{
						if (isdigit(i))
						{
							digit = 1;
						}
						else
						{
							digit = 0;
							break;
						}
					}

					if (digit)
					{
						nomerRyada = stoi(номер–€дка);

						if (nomerRyada > 0 && nomerRyada <= 15)
						{
							cout << endl;
							break;
						}
						else
						{
							cout << "Ќекоректний ввiд!" << endl;
						}
					}
					else
					{
						cout << "Ќекоректний ввiд!" << endl;
					}
				}

				switch (nomerRyada)
				{
				case 1:
					set–≥кѕочаткуЌавчальнного–оку();
					break;
				case 2:
					setƒатаѕершого”року();
					break;
				case 3:
					setƒата2ого”року();
					break;
				case 4:
					setƒата3ого”року();
					break;
				case 5:
					setƒата4ого”року();
					break;
				case 6:
					setƒата5ого”року();
					break;
				case 7:
					setƒата6ого”року();
					break;
				case 8:
					setƒатаѕоловини”року();
					break;
				case 9:
					setƒатаќстанньогоƒзв≥нка();
					break;
				case 10:
					setѕочатокќс≥нн≥х ан≥кул();
					break;
				case 11:
					set ≥нецьќс≥нн≥х ан≥кул();
					break;
				case 12:
					setѕочаток«имових ан≥кул();
					break;
				case 13:
					set ≥нець«имових ан≥кул();
					break;
				case 14:
					setѕочаток¬ен€них ан≥кул();
					break;
				case 15:
					set ≥нець¬есн€них ан≥кул();
					break;
				}
			}
		}
	}

	void ћетод¬изначенн€¬исокосного–оку()
	{
		if (р≥кѕочаткуЌавчальнного–оку % 4 == 0 && (р≥кѕочаткуЌавчальнного–оку % 100 != 0
			|| р≥кѕочаткуЌавчальнного–оку % 400 == 0))
		{
			високосний–≥кѕочаткуЌавчальнного–оку = true;
		}
		else
		{
			високосний–≥кѕочаткуЌавчальнного–оку = false;
		}

		if (р≥к«ак≥нченн€Ќавчальнного–оку % 4 == 0 && (р≥к«ак≥нченн€Ќавчальнного–оку % 100 != 0
			|| р≥к«ак≥нченн€Ќавчальнного–оку % 400 == 0))
		{
			високосний–≥к«ак≥нченн€Ќавчальнного–оку = true;

			ƒовжинаћ≥с€ц€.at(5) = 29;
		}
		else
		{
			високосний–≥к«ак≥нченн€Ќавчальнного–оку = false;

			ƒовжинаћ≥с€ц€.at(5) = 28;
		}
	}

	void ¬изначенн€ƒн€ѕершого”року()
	{
		int a, y, m;
		a = (14 - датаѕершого”року % 100) / 12;
		y = р≥кѕочаткуЌавчальнного–оку - a;
		m = датаѕершого”року % 100 + 12 * a - 2;

		деньѕершого”року = (7000 + (датаѕершого”року / 100 + y + y / 4 - y / 100 + y / 400 + (31 * m) / 12)) % 7;
	}

	void ¬с≥ƒатиз0109()
	{
		int number = 109;

		for (int i = 0; i < 4; i++)
		{
			for (int j = 1; j <= ƒовжинаћ≥с€ц€.at(i); j++)
			{
				вс≥ƒатиЌавчального–оку.push_back((number + i) + (100 * (j - 1)));
			}
		}

		number = 101;

		for (int i = 4; i < 12; i++)
		{
			for (int j = 1; j <= ƒовжинаћ≥с€ц€.at(i); j++)
			{
				вс≥ƒатиЌавчального–оку.push_back((number + i - 4) + (100 * (j - 1)));
			}
		}
	}

	void ¬изначенн€ƒат”рок≥в()
	{
		system("cls");

		// вив≥д дат
		gotoxy(0, 4);
		cout << endl << "ƒати урокiв:" << endl << endl;

		int lec1 = (датаѕершого”року / 100) - 1;
		int lec2 = (дата2ого”року / 100) - 1;
		int lec3 = (дата3ого”року / 100) - 1;
		int lec4 = (дата4ого”року / 100) - 1;
		int lec5 = (дата5ого”року / 100) - 1;
		int lec6 = (дата6ого”року / 100) - 1;
		int lec05 = (дата05”року / 100) - 1;

		int початокќK = 0;
		int к≥нецьќK = 0;
		int початок«K = 0;
		int к≥нець«K = 0;
		int початок¬K = 0;
		int к≥нець¬K = 0;

		for (int i = 0; i < вс≥ƒатиЌавчального–оку.size(); i++)
		{
			if (вс≥ƒатиЌавчального–оку.at(i) == початокќс≥нн≥х ан≥кул)
			{
				початокќK = i;
			}

			if (вс≥ƒатиЌавчального–оку.at(i) == к≥нецьќс≥нн≥х ан≥кул)
			{
				к≥нецьќK = i;
			}

			if (вс≥ƒатиЌавчального–оку.at(i) == початок«имових ан≥кул)
			{
				початок«K = i;
			}

			if (вс≥ƒатиЌавчального–оку.at(i) == к≥нець«имових ан≥кул)
			{
				к≥нець«K = i;
			}

			if (вс≥ƒатиЌавчального–оку.at(i) == початок¬есн€них ан≥кул)
			{
				початок¬K = i;
			}

			if (вс≥ƒатиЌавчального–оку.at(i) == к≥нець¬есн€них ан≥кул)
			{
				к≥нець¬K = i;
			}
		}

		for (int i = 0; i < вс≥ƒатиЌавчального–оку.size(); i++)
		{
			if (датаѕершого”року > 0 && i == lec1) //   1 urok
			{
				if ((i < початокќK) || (i >= к≥нецьќK && i < початок«K) || 
					(i >= к≥нець«K && i < початок¬K) || (i >= к≥нець¬K))
				{
					if (вс≥ƒатиЌавчального–оку.at(lec1) / 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec1) / 100 << ".";
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec1) / 100 << ".";
					}

					if (вс≥ƒатиЌавчального–оку.at(lec1) % 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec1) % 100 << endl;
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec1) % 100 << endl;
					}

					ƒати”рок≥в.push_back(вс≥ƒатиЌавчального–оку.at(lec1));

					к≥льк≥сть”рок≥в«а–≥к++;

					if (i < початок«K)
					{
						к≥льк≥сть”рок≥в«а1семестр++;
					}
					else
					{
						к≥льк≥сть”рок≥в«а2семестр++;
					}
				}
				lec1 += 7;
			}

			if (дата2ого”року > 0 && i == lec2)   // 2 yrok v nedeli
			{
				if ((i < початокќK) || (i >= к≥нецьќK && i < початок«K) || 
					(i >= к≥нець«K && i < початок¬K) || (i >= к≥нець¬K))
				{
					if (вс≥ƒатиЌавчального–оку.at(lec2) / 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec2) / 100 << ".";
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec2) / 100 << ".";
					}

					if (вс≥ƒатиЌавчального–оку.at(lec2) % 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec2) % 100 << endl;
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec2) % 100 << endl;
					}

					if (i < початок«K)
					{
						к≥льк≥сть”рок≥в«а1семестр++;
					}
					else
					{
						к≥льк≥сть”рок≥в«а2семестр++;
					}

					ƒати”рок≥в.push_back(вс≥ƒатиЌавчального–оку.at(lec2));

					к≥льк≥сть”рок≥в«а–≥к++;
				}
				lec2 += 7;
			}

			if (дата3ого”року > 0 && i == lec3)      // 3 yrok v nedeli
			{
				if ((i < початокќK) || (i >= к≥нецьќK && i < початок«K) || 
					(i >= к≥нець«K && i < початок¬K) || (i >= к≥нець¬K))
				{
					if (вс≥ƒатиЌавчального–оку.at(lec3) / 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec3) / 100 << ".";
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec3) / 100 << ".";
					}

					if (вс≥ƒатиЌавчального–оку.at(lec3) % 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec3) % 100 << endl;
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec3) % 100 << endl;
					}

					if (i < початок«K)
					{
						к≥льк≥сть”рок≥в«а1семестр++;
					}
					else
					{
						к≥льк≥сть”рок≥в«а2семестр++;
					}

					ƒати”рок≥в.push_back(вс≥ƒатиЌавчального–оку.at(lec3));

					к≥льк≥сть”рок≥в«а–≥к++;
				}
				lec3 += 7;
			}

			if (дата4ого”року > 0 && i == lec4)        // 4 yrok v nedeli
			{
				if ((i < початокќK) || (i >= к≥нецьќK && i < початок«K) || 
					(i >= к≥нець«K && i < початок¬K) || (i >= к≥нець¬K))
				{
					if (вс≥ƒатиЌавчального–оку.at(lec4) / 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec4) / 100 << ".";
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec4) / 100 << ".";
					}

					if (вс≥ƒатиЌавчального–оку.at(lec4) % 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec4) % 100 << endl;
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec4) % 100 << endl;
					}

					if (i < початок«K)
					{
						к≥льк≥сть”рок≥в«а1семестр++;
					}
					else
					{
						к≥льк≥сть”рок≥в«а2семестр++;
					}

					ƒати”рок≥в.push_back(вс≥ƒатиЌавчального–оку.at(lec4));

					к≥льк≥сть”рок≥в«а–≥к++;
				}
				lec4 += 7;
			}

			if (дата5ого”року > 0 && i == lec5)     // 5 yrok v nedeli
			{
				if ((i < початокќK) || (i >= к≥нецьќK && i < початок«K) || 
					(i >= к≥нець«K && i < початок¬K) || (i >= к≥нець¬K))
				{
					if (вс≥ƒатиЌавчального–оку.at(lec5) / 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec5) / 100 << ".";
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec5) / 100 << ".";
					}

					if (вс≥ƒатиЌавчального–оку.at(lec5) % 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec5) % 100 << endl;
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec5) % 100 << endl;
					}

					if (i < початок«K)
					{
						к≥льк≥сть”рок≥в«а1семестр++;
					}
					else
					{
						к≥льк≥сть”рок≥в«а2семестр++;
					}

					ƒати”рок≥в.push_back(вс≥ƒатиЌавчального–оку.at(lec5));

					к≥льк≥сть”рок≥в«а–≥к++;
				}
				lec5 += 7;
			}

			if (дата6ого”року > 0 && i == lec6)      // 6 yrok v nedeli
			{
				if ((i < початокќK) || (i >= к≥нецьќK && i < початок«K) || 
					(i >= к≥нець«K && i < початок¬K) || (i >= к≥нець¬K))
				{
					if (вс≥ƒатиЌавчального–оку.at(lec6) / 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec6) / 100 << ".";
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec6) / 100 << ".";
					}

					if (вс≥ƒатиЌавчального–оку.at(lec6) % 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec6) % 100 << endl;
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec6) % 100 << endl;
					}

					if (i < початок«K)
					{
						к≥льк≥сть”рок≥в«а1семестр++;
					}
					else
					{
						к≥льк≥сть”рок≥в«а2семестр++;
					}

					ƒати”рок≥в.push_back(вс≥ƒатиЌавчального–оку.at(lec6));

					к≥льк≥сть”рок≥в«а–≥к++;
				}
				lec6 += 7;
			}

			if (дата05”року > 0 && i == lec05)   // 0.5 yrok v nedeli
			{
				if ((i < початокќK) || (i >= к≥нецьќK && i < початок«K) ||
					(i >= к≥нець«K && i < початок¬K) || (i >= к≥нець¬K))
				{
					if (вс≥ƒатиЌавчального–оку.at(lec05) / 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec05) / 100 << ".";
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec05) / 100 << ".";
					}

					if (вс≥ƒатиЌавчального–оку.at(lec05) % 100 < 10)
					{
						cout << "0" << вс≥ƒатиЌавчального–оку.at(lec05) % 100 << endl;
					}
					else
					{
						cout << вс≥ƒатиЌавчального–оку.at(lec05) % 100 << endl;
					}

					if (i < початок«K)
					{
						к≥льк≥сть”рок≥в«а1семестр++;
					}
					else
					{
						к≥льк≥сть”рок≥в«а2семестр++;
					}

					ƒати”рок≥в.push_back(вс≥ƒатиЌавчального–оку.at(lec05));

					к≥льк≥сть”рок≥в«а–≥к++;
				}
				lec05 += 14;
			}

			if (вс≥ƒатиЌавчального–оку.at(i) == датаќстанньогоƒзв≥нка)
			{
				break;
			}
		}
	}

	ofstream fs;

	void myFile()
	{
		system("cls");

		string txt = ".txt";

		string doc = ".doc";

		string nameFile;

		cout << "¬ведiть назву документа дл€ збереженн€ даних:" << endl;

		cin >> nameFile;

		cout << endl << "¬иберiть формат документа." << endl << endl;

		cout << "ƒокумент Microsoft Word\t\t1" << endl;
		cout << "“екстовий документ \t\t2" << endl;

		string formatDoc;

		cin >> formatDoc;

		if (formatDoc == "1")
		{
			nameFile = nameFile + doc;
		}

		if (formatDoc == "2")
		{
			nameFile = nameFile + txt;
		}

		fs.open(nameFile);

		if (!fs.is_open())
		{
			cout << "ѕомилка збереженн€." << endl;
		}
		else
		{
			cout << endl << endl << "¬аш документ збережено в папцi, де знаходитьс€ дана програма." << endl;
			SetConsoleCP(1251);
			fs << " iлькiсть годин за навчальний рiк:    " << к≥льк≥сть”рок≥в«а–≥к << endl;
			fs << " iлькiсть годин за 1 семестр:         " << к≥льк≥сть”рок≥в«а1семестр << endl;
			fs << " iлькiсть годин за 2 семестр:         " << к≥льк≥сть”рок≥в«а2семестр << endl;

			fs << endl << endl << " ƒати урокiв:" << endl << endl;
			for (auto& it : ƒати”рок≥в)
			{
				if (it / 100 < 10)
				{
					fs << "   " << "0" << it / 100 << ".";
				}
				else
				{
					fs << "   " << it / 100 << ".";
				}

				if (it % 100 < 10)
				{
					fs << "0" << it % 100 << endl;
				}
				else
				{
					fs << it % 100 << endl;
				}
			}
		}
		SetConsoleCP(866);
		fs.close();
	}
};

int main()
{
	setlocale(LC_ALL, "Ukrainian");

	 алендарнеѕлануванн€ ѕлануванн€;

	ѕлануванн€.¬веденн€ƒаних();

	ѕлануванн€.ѕерев≥рка¬веденихƒаних();

	ѕлануванн€.ћетод¬изначенн€¬исокосного–оку();

	ѕлануванн€.¬изначенн€ƒн€ѕершого”року();

	ѕлануванн€.¬с≥ƒатиз0109();

	ѕлануванн€.¬изначенн€ƒат”рок≥в();

	ѕлануванн€.get ≥льк≥сть”рок≥в();

	ѕлануванн€.myFile();
}